{"list":[{"name":"Microvilli","description":"The pigmented layer of the retina is composed of a low cuboidal epithelium with long sheetlike apical microvilli. Measuring 5-7μm in length, these microvilli interdigitate with photoreceptor cell outer segments(Standring， 2016) . The microvilli that surround the outer segments of cone photoreceptors are usually devoid of organelles while, in contrast, those surrounding rod photoreceptors are abundant in cellular organelles.Pigment cell microvilli house a core bundle of densely packed actin filaments.Myosin has been localized to the bases of apical processes(Bonilha et al., 2006)."},{"name":"Rod Cells","description":"Rod cells are one of the two photoreceptor cell types of the retina. Photoreceptors are defined as highly differentiated neuroepithelial cells that are sensitive to light. Rod cells are radially oriented and long, measuring approximately 20-30 μm from the e external tip of f the outer segment to the inner synaptic terminal, the spherule. They serve a scotopic function, meaning they are maximally sensitive to low levels of monochromatic light. It is estimated there are approximately 92 million rods in the human eye, however, with significant inter-individual variation (Krstic, 2013; Molday and Moritz, 2015; Standring, 2016)."},{"name":"Cone Cells","description":"Cone cells are one of the two classes of photoreceptor cell located in the retina of the eye.Long and radially oriented structures, photoreceptors are defined as highly differentiated neuroepithelial cells that are sensitive to light.Cone cells are approximately 40-50μm long and it is estimated there are approximately 4.6 million cones in the human eye； but with significant inter-individual variation(Krstic, 2013； Molday and Moritz， 2015； Standring, 2016)."},{"name":"Horizontal Neurons","description":"Horizontal neurons are interconnecting neurons described as or that transfer information in a lateral or horizontal direction. Interconnecting neurons, in tem neurons， are specific types that act as an intermediary role in the transfer of information between two projection neurons.Horizontal cells are specifically inhibitory classified as interneurons (Standring, 2016) ."},{"name":"Pigmented Layer","description":"The outermost layer of the retina， the pigmented layer, is a composed of pigment cells arranged as a continuous， single row of cuboidal epithelial cells.There are approximately 4-6 million pigment cells in the retina.These cells tend to have a flat appearance in radial section and hexagonal or pentagonal appearance in surface view(Standring, 2016) ."},{"name":"Choroidocapillary","description":"The choroidocapillary lamina forms the innermost layer of the choroid.It is composed of densely packed, large fenestrated capillaries that are freely an as to mo sing.This layer is so highly vascularized that the light reflected from the back of the eye in flash photography is colored an intense red."},{"name":"Basal Complex","description":"The basal complex, otherwise known as the lamina vitreal or Bruch's membrane, is a barrier lying between the choroidocapillary and the retinal pigment epithelium.It is 2-4pm thick and is composed of a central elastic layer flanked by inner and outer fibrous layers of collagen and basement membrane(basal lamina)."},{"name":"Bipolar Neurons","description":"Appropriately named， bipolar neurons are recognizable by two distinct projections， one axon and one dendrite, attached to a cell body.Known as the second-order neurons in the visual pathway, bipolar neurons are responsible for relaying information from photoreceptors cells to ganglion cells(Remington and Goodwin, 2011)."},{"name":"Radial Glial","description":"Radial glial cells， or Muller cells, are the most common type of glial cell in the retina. Glial cells are specialized to surround， support and insulate neurons. There are approximately 10 milion Muller cells in the retina, collectively forming a dense regular pattern around the neurons they support (Remington and Goodwin, 2011; Bring man net al., 2006)."},{"name":"Retinal Ganglion","description":"Retinal ganglion cells are described as the third-order output neurons of the retina. There are approximately 0.7-1.5 million in the human retina.Retinal ganglion cells exhibit a topographic distribution across the retinal surface.They reach a peak density in a horizontally orientated elliptical ring surrounding the foveal center, though they are absent over the fovea itself (Standring, 2016; Ross and Pawlina, 2006). They are most numerous around in the perifoveal region of macula where they can be found to be stacked up to 10 cells thick. Their density remains high enough to be multiple cells thick in the macular region. Throughout most of the retina， they form a single layer with the distance between neighbouring cells increasing with increasing eccentricity."},{"name":"Amacrine Cells","description":"Amacrine cells are local circuit neurons， or inte meuron s.Intermeurons, a specific type of neuron that act as an intermediary, affecting the transfer between two projection neurons.Amacrine cells are classified as inhibitory interneurons (Standring, 2016)."},{"name":"Interplexiform Neurons","description":"Interplexiform neurons are multipolar neurons that link the inner and outer plexiform layers.They receive synaptic input from the inner plexiform layer and transmit synaptic outputs to the outer plexiform layer.Therefore， they serve a “feedback” function, conveying signals against the general flow of information in the retina(Kolb， 1995a)."},{"name":"Arteriols","description":"The retina requires a blood supply from two sources in order to maintain proper function.The outer five layers of the retina are supported metabolically by diffusion from the vasculature of the choroid (choriocapillaris) .The inner layers of the retina receive blood from capillaries that arise from the central retinal artery, a branch of the ophthalmic artery. The central retinal artery passes within the optic nerve to enter the eye through the lamina cribrosa. It then divides into superior and inferior branches, which in turn give rise to superior and inferior nasal and superior and inferior temporal branches.Each of these branches supplies a quadrant of the retina.They do not overlap or anastomose with each other, thus, if an artery becomes blocked, loss of vision occurs in the corresponding quadrant.These vessels run within the layer of nerve fibers and the ganglion cell layer of the retina and are easily visualized through an ophthalmoscope. Arterioles arising from these arteries pass deeply, into the layers of the retina to form capillary networks.These capillary beds can be found in three layers:"},{"name":"Protoplasmic Astrocytes","description":"Recognizable by their fibrous， star-shaped appearance and flattened cell body, astrocytes are one of the neuroglial cells of the retina.Other neuroglial cells in the retina include radial glial(Muller) cells and microglia. Astrocytes in the retina may also be described as perivascular cells, as they form an irregular supportive network around retinal fibers and capillaries(Kolb, 1995d; Remington and Goodwin, 2011) ."},{"name":"Endfoot","description":"The inner limiting layer， or membrane， is described as the innermost boundary of the retina and occurs at the interface between the optic nerve fiber layer of the retina and the vitreous body.The outer, retinal surface of the membrane is uneven， which can be attributed to the inner processes of radial glial(Muller) cells that terminate in a foot plate known as the “endfoot.” Endfeet of Muller cells tile together like pieces of a jigsaw puzzle forming a continuous sheet. The inner, vitreal surface of the limiting membrane has a smooth appearance that is covered by a membrane, with some vitreous fibers apparent in the periphery(Remington and Goodwin， 2011)."}]}